eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоБлокам/абс_ЛимитыПоБлокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ЛимитыПоБлокам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ЛимитыПоБлокам/ManagerModule.bsl
Функция ПревышенЛимитПоЦФО(Сумма,ЦФО) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Сумма > абс_ЛимитыПоБлокам.Сумма
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПревышение
		|ИЗ
		|	РегистрСведений.абс_ЛимитыПоБлокам КАК абс_ЛимитыПоБлокам
		|ГДЕ
		|	абс_ЛимитыПоБлокам.ЦФО = &ЦФО";
		
	Запрос.УстановитьПараметр("Сумма", Сумма);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЕстьПревышение; 
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции
